{
  "id": "sfsg-education-4591",
  "name": "Education",
  "category": "sfserviceguide",
  "description": "Serves: Highschool Fee based, with Financial Aid Program",
  "fullDescription": "Serves: Highschool Fee based, with Financial Aid Program",
  "whatTheyOffer": "Serves: Highschool Fee based, with Financial Aid Program",
  "howToGetIt": "Financial Aid program is designed to help families bridge the gap between their own financial resources and the cost of a Riordan education. The program is based on need and is funded by endowment and other fundraising efforts. Decisions regarding financial aid are separate from admission decisions, and are made by a committee after careful review of all information provided in the financial aid application. How to Apply for Financial Aid Riordan utilizes the services of TADS to help determine a family’s eligibility for financial aid. Families applying for Financial Aid must submit all information via TADS by February 4, 2025 for the 2025-26 school year. Notifications about financial aid will be mailed with acceptance letters. Current families must reapply each year. Financial aid awards are issued for one school year. Families will be called upon to complete applications annually to substantiate continued need. Outside scholarships may be recommended to those students whose profile supports the donors’ criteria, but all will first require a completed TADS online application.",
  "groups": [
    "everyone"
  ],
  "areas": [
    "San Francisco"
  ],
  "city": "San Francisco",
  "website": "https://www.riordanhs.org/admissions/tuition-and-financial-aid",
  "cost": null,
  "phone": "4155868200",
  "email": "https://www.riordanhs.org/",
  "address": "175 Frida Kahlo Way , San Francisco, CA, 94112",
  "requirements": null,
  "howToApply": null,
  "keywords": [
    "san francisco",
    "sf service guide",
    "education",
    "academic support"
  ],
  "lifeEvents": [],
  "agency": "Archbishop Riordan High School",
  "lastUpdated": "2026-01-22",
  "dataSource": "dataSF",
  "externalId": "4591",
  "sourceUrl": "https://www.riordanhs.org/admissions/tuition-and-financial-aid"
}