{
  "id": "sfsg-adoption-services-636",
  "name": "Adoption Services",
  "category": "sfserviceguide",
  "description": "Foster-to-Adopt with AFS The \"Foster-to-Adopt\" approach offers a significant opportunity for those aiming to adopt a foster child or youth. Children are initially placed with resource parents before their biological parents' rights are terminated. Once a fit adoptive parent or family emerges and the rights are terminated, AFS ensures a smooth and supported journey toward adoption. Why Choose Adoption through Foster Care? For numerous Northern California families, adopting through foster care i",
  "fullDescription": "Foster-to-Adopt with AFS The \"Foster-to-Adopt\" approach offers a significant opportunity for those aiming to adopt a foster child or youth. Children are initially placed with resource parents before their biological parents' rights are terminated. Once a fit adoptive parent or family emerges and the rights are terminated, AFS ensures a smooth and supported journey toward adoption. Why Choose Adoption through Foster Care? For numerous Northern California families, adopting through foster care i",
  "whatTheyOffer": "Foster-to-Adopt with AFS The \"Foster-to-Adopt\" approach offers a significant opportunity for those aiming to adopt a foster child or youth. Children are initially placed with resource parents before their biological parents' rights are terminated. Once a fit adoptive parent or family emerges and the rights are terminated, AFS ensures a smooth and supported journey toward adoption. Why Choose Adoption through Foster Care? For numerous Northern California families, adopting through foster care is ",
  "howToGetIt": "Becoming an adoptive parent starts with getting accredited as a resource parent. Whether your goal is fostering or adoption, state certification is mandatory. AFS recognizes the diverse paths to family building and ensures tailored resources and support for every family's unique journey. LEARN ABOUT BECOMING AN AFS RESOURCE OR ADOPTIVE PARENT CONTACT US (800) 300-1022 rfarecruitment@afs4kids.org Or visit https://family.binti.com/users/signup/afs-rfa to start an application. AFS is licensed to cater to counties like Alameda, Contra Costa, San Francisco, Solano, Marin, Sonoma, and Sacramento. For queries, contact: (800)300-1022 or rfarecruitment@afs4kids.org.",
  "groups": [
    "veterans",
    "lgbtq",
    "youth"
  ],
  "areas": [
    "San Francisco"
  ],
  "city": "San Francisco",
  "website": "https://www.afs4kids.org/services/adoption-services/",
  "cost": "Adopting through foster care is free. Families might also qualify for a monthly stipend for child care and Medi-Cal benefits until the child is 18 or, in some cases, 21.",
  "phone": "4156560116",
  "email": "rfarecruitment@afs4kids.org",
  "address": "250 Executive Park Blvd, San Francisco, CA, 94134",
  "requirements": null,
  "howToApply": null,
  "keywords": [
    "san francisco",
    "sf service guide",
    "mentorship",
    "in-home support",
    "family support",
    "guardianship",
    "youth",
    "adoption",
    "money",
    "care"
  ],
  "lifeEvents": [],
  "agency": "Alternative Family Services (AFS)",
  "lastUpdated": "2026-01-22",
  "dataSource": "dataSF",
  "externalId": "636",
  "sourceUrl": "https://www.afs4kids.org/services/adoption-services/"
}