{
  "id": "sfsg-compass-behavioral-health-services-1755",
  "name": "Compass Behavioral Health Services",
  "category": "sfserviceguide",
  "description": "Compass Behavioral Health Services offers confidential emotional support and therapy for families who are experiencing homelessness, at risk of homelessness, newly housed, or engaged in any Compass program. On-demand crisis counseling needs are available.",
  "fullDescription": "Compass Behavioral Health Services offers confidential emotional support and therapy for families who are experiencing homelessness, at risk of homelessness, newly housed, or engaged in any Compass program. On-demand crisis counseling needs are available.",
  "whatTheyOffer": "Compass Behavioral Health Services offers confidential emotional support and therapy for families who are experiencing homelessness, at risk of homelessness, newly housed, or engaged in any Compass program. Services: - On-demand crisis counseling - Compass therapists work with individual parents, children, couples, parents and child(ren) together, or the whole family - Compass therapists are trained to help clients to heal from past trauma and manage a range of issues including depression and an",
  "howToGetIt": "How to get connected: - Therapy is available to any family enrolled in one of Compass's programs. Please contact your case manager and ask them to make a referral to Compass Behavioral Health Services. - If you are not enrolled in a Compass program, please call our main phone line, 415-644-0504, and ask to speak to a Counselor of the Day. You will be connected to a Counselor who will do an intake and talk to you about options for receiving support - Contact Susan Reider, LMFT, Clinical Director at sreider@compass-sf.org or Bolor Purvee, AMFT, Assistant Program Director at bpurvee@compass-sf.org",
  "groups": [
    "unhoused"
  ],
  "areas": [
    "San Francisco"
  ],
  "city": "San Francisco",
  "website": "https://www.compass-sf.org/cbhs",
  "cost": null,
  "phone": "4156440504",
  "email": "info@compass-sf.org",
  "address": "37 Grove Street, San Francisco, CA, 94102",
  "requirements": null,
  "howToApply": null,
  "keywords": [
    "san francisco",
    "sf service guide",
    "counseling",
    "specialized therapy",
    "mental health care",
    "anger management",
    "group therapy",
    "family counseling",
    "individual counseling",
    "support network"
  ],
  "lifeEvents": [],
  "agency": "Compass Family Services",
  "lastUpdated": "2026-01-22",
  "dataSource": "dataSF",
  "externalId": "1755",
  "sourceUrl": "https://www.compass-sf.org/cbhs"
}