{
  "id": "sfsg-u-visa-t-visa-vawa-979",
  "name": "U Visa/T Visa/VAWA",
  "category": "sfserviceguide",
  "description": "The Immigrant Legal Resource Center (ILRC) provides technical assistance, trainings and practice manuals on critical immigration options for vulnerable immigrants including concerns under the U Visa, VAWA, and T Visa.",
  "fullDescription": "The Immigrant Legal Resource Center (ILRC) provides technical assistance, trainings and practice manuals on critical immigration options for vulnerable immigrants including concerns under the U Visa, VAWA, and T Visa.",
  "whatTheyOffer": "The Immigrant Legal Resource Center (ILRC) provides technical assistance, trainings and practice manuals on critical immigration options for vulnerable immigrants including immigrant victims of domestic violence, human trafficking and other crimes. - U Visa and VAWA: Immigration Relief for Survivors of Domestic Violence and Other Crimes - T Visa: Immigration Relief for Survivors of Sex or Labor Trafficking The ILRC does not provide direct legal services or individual legal consultations.",
  "howToGetIt": "For technical assistance, Attorney of the Day (AOD) consultation service offers expert legal technical assistance to attorneys, nonprofit staff, criminal defenders, and others assisting immigrant clients. They offer case-specific consultations on immigration law and practice. To discuss rates and set up a contract, please contact the AOD Administrator at AODAdmin@ilrc.org or (415) 255-9499.",
  "groups": [
    "immigrants"
  ],
  "areas": [
    "San Francisco"
  ],
  "city": "San Francisco",
  "website": "https://www.ilrc.org/u-visa-t-visa-vawa",
  "cost": "Most educational content is free; some publications can be purchased for a fee",
  "phone": "4152559499",
  "email": "ilrc@ilrc.org",
  "address": "1458 Howard Street, San Francisco, CA, 94103",
  "requirements": null,
  "howToApply": null,
  "keywords": [
    "san francisco",
    "sf service guide",
    "family support",
    "citizenship & immigration",
    "advocacy & legal aid",
    "legal",
    "legal assistance",
    "sfsg-domesticviolence",
    "immigration assistance"
  ],
  "lifeEvents": [],
  "agency": "Immigrant Legal Resource Center",
  "lastUpdated": "2026-01-22",
  "dataSource": "dataSF",
  "externalId": "979",
  "sourceUrl": "https://www.ilrc.org/u-visa-t-visa-vawa"
}